Config/DataProcessors/СверткаИнформационнойБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>СверткаИнформационнойБазы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодСвертки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организации</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантСвертки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийЭтапСвертки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательНеУчитываетсяНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоВыбранныеОрганизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекомендуемыеПараметры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановитьДатуЗапретаИзмененияДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСтрокВДокументеВводаОстатков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СпособыСверткиОбъектовМетаданных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипОбъектаМД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектМД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектМДСиноним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособСвертки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстаревшаяНастройка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/DataProcessors/СверткаИнформационнойБазы/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

&НаКлиенте
Перем СоздатьРезервнуюКопиюПриЗакрытии;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаписьЖурналаРегистрации(
			Обработки.СверткаИнформационнойБазыОстатками.ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,
			,
			,
			НСтр("ru = 'Открытие обработки'"));
			
	УстановитьУсловноеОформление();
	
	ВосстановитьНастройкиСверткиИнформационноБазыНаСервере();
	
	Элементы.СпособыСверткиРегистровБухгалтерии.ОтборСтрок  = Новый ФиксированнаяСтруктура("ТипОбъектаМД","РегистрБухгалтерии");
	Элементы.СпособыСверткиРегистровНакопления.ОтборСтрок   = Новый ФиксированнаяСтруктура("ТипОбъектаМД","РегистрНакопления");
	Элементы.СпособыСверткиРегистровСведений.ОтборСтрок 	= Новый ФиксированнаяСтруктура("ТипОбъектаМД","РегистрСведений");
	Элементы.СпособыСверткиДокументов.ОтборСтрок 			= Новый ФиксированнаяСтруктура("ТипОбъектаМД","Документ");
	
	Элементы.ГруппаСинхронизацияДанных.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ВебКлиент Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Свертка базы недоступна в веб-клиенте.'");
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации("Свертка Информационной базы",,ТекстСообщения,,Истина);
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	#КонецЕсли
	
	ПредставлениеПериодаСвертки = Год(Объект.ПериодСвертки);

	СкрыватьНастройкиПриФормированииОтчета = Истина;
	//СоздатьРезервнуюКопиюПриЗакрытии 	   = Ложь;
	ПередОткрытиемСтраницы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаСверткиПриИзменении(Элемент)
	
	Объект.ПериодСвертки = Дата(СтрЗаменить(ПредставлениеПериодаСвертки, Символы.НПП,"") + "0101");
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоВыбранныеОрганизацииПриИзменении(Элемент)
	
	Элементы.ОтмеченныеОрганизации.Доступность = Объект.ТолькоВыбранныеОрганизации;
	Если Объект.ТолькоВыбранныеОрганизации = 0 Тогда
		ОтмеченныеОрганизации.ЗаполнитьПометки(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДанныхПриИзменении(Элемент)
	
	ВидимостьРегистров = Ложь;
	Если Объект.ТипДанных = "РегистрыСведенийИНакопления" Тогда
		ВидимостьРегистров = Истина;
	КонецЕсли;
	
	Элементы.ГруппаОсновныеНастройки.Видимость = Не ВидимостьРегистров;
	Элементы.ГруппаРегистрыНакопления.Видимость = ВидимостьРегистров;
	Элементы.ГруппаРегистрыСведений.Видимость = ВидимостьРегистров;
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.РезультатПроверки, "НеАктуальность");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	СверткаВыполнена = Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницыПомощника.ПодчиненныеЭлементы.УспешноеЗавершение 
		Или Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницыПомощника.ПодчиненныеЭлементы.НеуспешноеЗавершение;
	
	Если СверткаВыполнена Тогда
		СохранитьНастройкиСвертки(0, Истина);
	Иначе		
		СохранитьНастройкиСвертки(Объект.ТекущийЭтапСвертки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьОткрытьЖурналРегистрацииНажатие(Элемент)
	
	ОткрытьФорму("Обработка.ЖурналРегистрации.Форма", Новый Структура("Пользователь", ИмяПользователя()));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуАктивныхПользователей(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОповещатьОЗакрытии", Истина);
	ОткрытьФорму("Обработка.АктивныеПользователи.Форма.АктивныеПользователи", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостояниеРезультатаПроверки(Элемент)
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.РезультатПроверки, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияРезервнаяКопияНажатие(Элемент)
	
	ОткрытьФорму("Обработка.РезервноеКопированиеИБ.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиСинхронизацииДанных(Команда)
	
	ОбменДаннымиКлиент.ОткрытьНастройкиСинхронизацииДанных();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтраницаРегистрыСведений

&НаКлиенте
Процедура СтраницаРегистрыСведенийСпособСверткиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка  = Ложь;
	ТекущиеДанныеЭлемента = Элементы.СпособыСверткиРегистровСведений.ТекущиеДанные;
	СпособыСверткиРегистровПриИзменении(Элемент, ДанныеВыбора, ТекущиеДанныеЭлемента);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСпособыСверткиРегистровНакопления

&НаКлиенте
Процедура СтраницаРегистрыНакопленияСпособСверткиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка  = Ложь;
	ТекущиеДанныеЭлемента = Элементы.СпособыСверткиРегистровНакопления.ТекущиеДанные;
	СпособыСверткиРегистровПриИзменении(Элемент, ДанныеВыбора, ТекущиеДанныеЭлемента);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСпособыСверткиРегистровБухгалтерии

&НаКлиенте
Процедура СпособыСверткиРегистровБухгалтерииСпособСверткиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка  = Ложь;
	ТекущиеДанныеЭлемента = Элементы.СпособыСверткиРегистровБухгалтерии.ТекущиеДанные;
	СпособыСверткиРегистровПриИзменении(Элемент, ДанныеВыбора, ТекущиеДанныеЭлемента);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСпособыСверткиДокументов

&НаКлиенте
Процедура СтраницаДокументыСпособСверткиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка  = Ложь;
	ТекущиеДанныеЭлемента = Элементы.СпособыСверткиДокументов.ТекущиеДанные;
	СпособыСверткиРегистровПриИзменении(Элемент, ДанныеВыбора, ТекущиеДанныеЭлемента);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Назад(Команда)
	
	ТекущаяСтраница			= Элементы.СтраницыПомощника.ТекущаяСтраница;
	Страницы				= Элементы.СтраницыПомощника.ПодчиненныеЭлементы;
	
	Если ТекущаяСтраница = Страницы.УдалениеСтарыхДокументов Тогда
		
		СохранитьНастройкиСвертки(4);
		ПередОткрытиемСтраницы();
		
	ИначеЕсли ТекущаяСтраница = Страницы.ПроверкаОстатков Тогда
		
		СохранитьНастройкиСвертки(3);
		ПередОткрытиемСтраницы();
		
	ИначеЕсли ТекущаяСтраница = Страницы.ПросмотрОпераций Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВопросПриПереходеКПредыдущемуЭтапуЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru='Для перехода к предыдущему этапу необходимо удалить все созданные ранее операции."
			+ Символы.ПС + "Удалить операции?'"), РежимДиалогаВопрос.ДаНет);
	
	ИначеЕсли ТекущаяСтраница = Страницы.ФормированиеОстатков Тогда
		
		СохранитьНастройкиСвертки(1);
		ПередОткрытиемСтраницы();
		
	ИначеЕсли ТекущаяСтраница = Страницы.НастройкаСвертки Тогда
		СохранитьНастройкиСвертки(0);
		ПередОткрытиемСтраницы();
		
	ИначеЕсли ТекущаяСтраница = Страницы.СозданиеРезервнойКопии Тогда
		
		Закрыть();
		ПараметрыФормы = Новый Структура("ОбработкаСвертки", 1);
		ОткрытьФорму("Обработка.СверткаИнформационнойБазыОстатками.Форма.Старт", ПараметрыФормы);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	
	ТекущаяСтраница			= Элементы.СтраницыПомощника.ТекущаяСтраница;
	Страницы				= Элементы.СтраницыПомощника.ПодчиненныеЭлементы;
	
	Если ТекущаяСтраница = Страницы.СозданиеРезервнойКопии Тогда
		СохранитьНастройкиСвертки(1);
		ПередОткрытиемСтраницы();
	ИначеЕсли ТекущаяСтраница = Страницы.НастройкаСвертки Тогда
		СохранитьНастройкиСвертки(2);
		ПередОткрытиемСтраницы();
	ИначеЕсли ТекущаяСтраница = Страницы.ФормированиеОстатков Тогда
		СохранитьНастройкиСвертки(2);
		Результат = СформироватьОстаткиНаСервере();
		ПроверитьСтатусВыполненияЗадания(Результат);
	ИначеЕсли ТекущаяСтраница = Страницы.ПросмотрОпераций Тогда
		СохранитьНастройкиСвертки(4);
		ПередОткрытиемСтраницы();
	ИначеЕсли ТекущаяСтраница = Страницы.ПроверкаОстатков Тогда
		СохранитьНастройкиСвертки(5);
		ПередОткрытиемСтраницы();
	ИначеЕсли ТекущаяСтраница = Страницы.УдалениеСтарыхДокументов Тогда
		Оповещение = Новый ОписаниеОповещения("ВопросУдалитьСтарыеДокументыЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru='Процесс удаления старых документов может занять продолжительное время." 
			+ Символы.ПС + "Удалить старые документы?'"), РежимДиалогаВопрос.ДаНет);
	ИначеЕсли ТекущаяСтраница = Страницы.УспешноеЗавершение Или ТекущаяСтраница = Страницы.НеуспешноеЗавершение Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПропуститьШаг(Команда)
	
	СохранитьНастройкиСвертки(1);
	ПередОткрытиемСтраницы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВерсиюКомпоненты(Команда)
	ОбщегоНазначенияКлиент.ЗарегистрироватьCOMСоединитель();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ПараметрыОтчета = ПодготовитьПараметрыОтчета();
	
	Если Не ОбработкаПроверкиЗаполнения(ПараметрыОтчета.НаборПоказателей) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения = СформироватьОтчетНаСервере(ПараметрыОтчета);
	
	мОжидающиеИзменения = Неопределено;
	
	// Операция еще не завершена, выполняется с помощью фонового задания (асинхронно).
	Если НЕ РезультатВыполнения.ЗаданиеВыполнено Тогда
		
		ИдентификаторЗадания = РезультатВыполнения.ИдентификаторЗадания;
		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьФормированиеОтчета", 1, Истина);
		
		ФормаДлительнойОперации = ОткрытьФорму("ОбщаяФорма.ДлительнаяОперация", Новый Структура("ИдентификаторЗадания", ИдентификаторЗадания), ЭтаФорма);
		
	Иначе 
		
		ЗагрузитьПодготовленныеДанные();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельНастроек(Команда)
	
	Элементы.ГруппаПанельНастроек.Видимость = Не Элементы.ГруппаПанельНастроек.Видимость;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРекомендуемымиПараметрамиСвертки(Команда)
	
	ТекстВопроса = НСтр("ru = 'Восстановить рекомендуемые настройки?'");
	Оповещение = Новый ОписаниеОповещения("ВопросВосстановитьРекомендуемыеНастройки", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПередОткрытиемСтраницы()
	
	ВидимостьКнопкиНазад = Истина;
	ФункцияКнопкиДалее   = Истина; // Истина = "Далее", Ложь = "Закрыть"
	
	Страницы = Элементы.СтраницыПомощника.ПодчиненныеЭлементы;
	
	Если Объект.ТекущийЭтапСвертки = 0 Тогда
		Элементы.СтраницыПомощника.ТекущаяСтраница = Страницы.СозданиеРезервнойКопии;
		//ВидимостьКнопкиНазад = Ложь;
	ИначеЕсли Объект.ТекущийЭтапСвертки = 1 Тогда
		Элементы.СтраницыПомощника.ТекущаяСтраница = Страницы.НастройкаСвертки;
		Элементы.ОтмеченныеОрганизации.Доступность = Объект.ТолькоВыбранныеОрганизации;
		Элементы.СтраницыПомощника.ТекущаяСтраница = Элементы.СтраницыПомощника.ПодчиненныеЭлементы.НастройкаСвертки;
	ИначеЕсли Объект.ТекущийЭтапСвертки = 2 Тогда
		Элементы.СтраницыПомощника.ТекущаяСтраница = Страницы.ФормированиеОстатков;
		//Элементы.ЗаполнитьРекомендуемымиПараметрамиСвертки.Доступность = Истина;
	ИначеЕсли Объект.ТекущийЭтапСвертки = 3 Тогда
		//Установка отбора по периоду свертки для просмотра операций
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ДокументыВводаОстатков.Отбор, "Дата", Объект.ПериодСвертки,,, Истина);
		Элементы.СтраницыПомощника.ТекущаяСтраница = Страницы.ПросмотрОпераций;
	ИначеЕсли Объект.ТекущийЭтапСвертки = 4 Тогда
		ЗаполнитьТаблицуМетаданных();
		Объект.ПоказательБУ = Истина;
		Объект.ТипДанных = "РегистрыБухгалтерии";
		СформироватьОтчет(Неопределено);
		Элементы.СтраницыПомощника.ТекущаяСтраница = Страницы.ПроверкаОстатков
	ИначеЕсли Объект.ТекущийЭтапСвертки = 5 Тогда
		Элементы.НадписьСвернутьИнформационнуюБазуНаНачало1.Заголовок = "Будут удалены документы до " 
			+ Формат(ПредставлениеПериодаСвертки,"ЧЦ=4; ЧГ=0;") + " года. " 
			+ "Процесс является необратимым.";
		Элементы.СтраницыПомощника.ТекущаяСтраница = Страницы.УдалениеСтарыхДокументов;
	ИначеЕсли Объект.ТекущийЭтапСвертки = 6 Тогда
		Элементы.СтраницыПомощника.ТекущаяСтраница = Страницы.УспешноеЗавершение;
		ВидимостьКнопкиНазад = Ложь;
		ФункцияКнопкиДалее   = Ложь;
	ИначеЕсли Объект.ТекущийЭтапСвертки = -1 Тогда
		Элементы.СтраницыПомощника.ТекущаяСтраница = Страницы.НеуспешноеЗавершение;
		ВидимостьКнопкиНазад = Ложь;
		ФункцияКнопкиДалее   = Ложь;
	КонецЕсли;
	
	КнопкаДалее = Элементы.Далее;
	КнопкаНазад = Элементы.Назад;

	КнопкаНазад.Видимость = ВидимостьКнопкиНазад;
	
	КнопкаДалее.Заголовок = ?(ФункцияКнопкиДалее, НСтр("ru = '&Далее >'"), НСтр("ru = '&Закрыть'"));
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиСверткиИнформационноБазыНаСервере()
	
	Статус = ПолучитьПустуюСтруктуруСтатусаСверткиИнформационнойБазы();
	
	ЗначениеХранилища = Константы.СтатусСверткиИнформационнойБазы.Получить();
	Если ЗначениеХранилища <> Неопределено Тогда
		СтатусИзНастроек = ЗначениеХранилища.Получить();
		Если СтатусИзНастроек <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Статус, СтатусИзНастроек); 
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Статус.ПериодСвертки) Тогда
		Статус.ПериодСвертки = НачалоГода(ТекущаяДата());
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект, Статус,,"СпособыСверткиОбъектовМетаданных");
	ТаблицаНастроек = Обработки.СверткаИнформационнойБазы.ПолучитьДеревоПоМетаданным(
		, Статус.СпособыСверткиОбъектовМетаданных.Количество() > 0, Статус.СпособыСверткиОбъектовМетаданных);
	ТаблицаНастроек.Сортировать("ОбъектМДСиноним");
	Объект.СпособыСверткиОбъектовМетаданных.Загрузить(ТаблицаНастроек);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Результат = Запрос.Выполнить();
	
	ОтмеченныеОрганизации.ЗагрузитьЗначения(Результат.Выгрузить().ВыгрузитьКолонку("Ссылка"));
	ОтмеченныеОрганизации.ЗаполнитьПометки(Не Объект.ТолькоВыбранныеОрганизации);
	
	Для Каждого Орг Из Объект.Организации Цикл
		
		НайденнаяОрганизация = ОтмеченныеОрганизации.НайтиПоЗначению(Орг.Значение);
		НайденнаяОрганизация.Пометка = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущийЭтапСвертки()
	
	Статус = Неопределено;
	
	ЗначениеХранилища = Константы.СтатусСверткиИнформационнойБазы.Получить();	
	Если ЗначениеХранилища <> Неопределено Тогда
		Статус = ЗначениеХранилища.Получить();
	КонецЕсли;
	
	ТекущийЭтапСвертки = ?(Статус = Неопределено, 0, Статус.ТекущийЭтапСвертки);
	
	Возврат ТекущийЭтапСвертки;
	
КонецФункции


&НаСервере
Процедура СохранитьНастройкиСвертки(ТекущийЭтап, Сбросить = Ложь)
	
	Объект.ТекущийЭтапСвертки = ТекущийЭтап;
	
	Объект.Организации.Очистить();
	Если Объект.ТолькоВыбранныеОрганизации Тогда
		Для Каждого Орг Из ОтмеченныеОрганизации Цикл
			Если Не Орг.Пометка Тогда
				Продолжить;
			КонецЕсли;
			Объект.Организации.Добавить(Орг.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Статус = ПолучитьПустуюСтруктуруСтатусаСверткиИнформационнойБазы();
	Если Не Сбросить Тогда
		ЗаполнитьЗначенияСвойств(Статус,Объект,,"СпособыСверткиОбъектовМетаданных");
	КонецЕсли;
	Статус.СпособыСверткиОбъектовМетаданных = Объект.СпособыСверткиОбъектовМетаданных.Выгрузить(, "ТипОбъектаМД,ОбъектМД,СпособСвертки");		
	
	Константы.СтатусСверткиИнформационнойБазы.Установить(Новый ХранилищеЗначения(Статус));
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСтатусВыполненияЗадания(Результат);
	
	// Операция еще не завершена, выполняется с помощью фонового задания (асинхронно).
	Если НЕ Результат.ЗаданиеВыполнено Тогда
		
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
		АдресХранилища       = Результат.АдресХранилища;
		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, ИдентификаторЗадания);
	Иначе
		Объект.ТекущийЭтапСвертки = ПолучитьТекущийЭтапСвертки();
		ПередОткрытиемСтраницы();			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
			ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			Объект.ТекущийЭтапСвертки = ПолучитьТекущийЭтапСвертки();
			ПередОткрытиемСтраницы();	
		Иначе
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания",
										 ПараметрыОбработчикаОжидания.ТекущийИнтервал,
										 Истина);
		КонецЕсли;
	Исключение
		Объект.ТекущийЭтапСвертки = ПолучитьТекущийЭтапСвертки();
		ПередОткрытиемСтраницы();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьФормированиеОтчета()
	
	Попытка
		
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
			ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			ЗагрузитьПодготовленныеДанные();
		Иначе
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания(
			"Подключаемый_ПроверитьФормированиеОтчета",
			ПараметрыОбработчикаОжидания.ТекущийИнтервал,
			Истина);
		КонецЕсли;
		
	Исключение
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаСервере
Функция СформироватьОстаткиНаСервере()
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("Организации"								, Объект.Организации);	
	ПараметрыОбработки.Вставить("ПериодСвертки"								, Объект.ПериодСвертки);
	ПараметрыОбработки.Вставить("ТолькоВыбранныеОрганизации"				, Объект.ТолькоВыбранныеОрганизации = 1);
	ПараметрыОбработки.Вставить("УстановитьДатуЗапретаИзмененияДанных"		, Объект.УстановитьДатуЗапретаИзмененияДанных);
	ПараметрыОбработки.Вставить("КоличествоСтрокВДокументеВводаОстатков"	, Объект.КоличествоСтрокВДокументеВводаОстатков);
	ПараметрыОбработки.Вставить("СпособыСверткиОбъектовМетаданных"			, Объект.СпособыСверткиОбъектовМетаданных.Выгрузить(, "ТипОбъектаМД,ОбъектМД,СпособСвертки"));
												 
										 
	// В файловом режиме работы выполняем операцию непосредственно (синхронно).
	ЗаданиеВыполнено = Ложь; 
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		Обработки.СверткаИнформационнойБазы.СоздатьДокументыВводаОстатков(ПараметрыОбработки,АдресХранилища);
		Результат = Новый Структура;
		Результат.Вставить("ЗаданиеВыполнено", Истина);
		Возврат Результат; 
	КонецЕсли;
	// В клиент-серверном режиме работы выполняем операцию в фоновом задании (асинхронно).
	НаименованиеЗадания = НСтр("ru = 'Формирование остатков.'");
	
	Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(УникальныйИдентификатор,
															"Обработки.СверткаИнформационнойБазы.СоздатьДокументыВводаОстатков", 
															ПараметрыОбработки,
															НаименованиеЗадания);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция УдалитьДокументыВводаОстатковНаСервере(ПериодСвертки)
	
	ПараметрыОбработки = Новый Структура("ПериодСвертки", ПериодСвертки);
	// В файловом режиме работы выполняем операцию непосредственно (синхронно).
	ЗаданиеВыполнено = Ложь; 
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		Обработки.СверткаИнформационнойБазы.УдалитьДокументыВводаОстатков(ПараметрыОбработки,АдресХранилища);
		Результат = Новый Структура;
		Результат.Вставить("ЗаданиеВыполнено", Истина);
		Возврат Результат; 
	КонецЕсли;
	// В клиент-серверном режиме работы выполняем операцию в фоновом задании (асинхронно).
	НаименованиеЗадания = НСтр("ru = 'Удаление сформированных остатков.'");
	
	Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(УникальныйИдентификатор,
															"Обработки.СверткаИнформационнойБазы.УдалитьДокументыВводаОстатков", 
															ПараметрыОбработки,
															НаименованиеЗадания);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СвернутьИнформационнуюБазуНаСервере()
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("Организации"								, Объект.Организации);	
	ПараметрыОбработки.Вставить("ПериодСвертки"								, Объект.ПериодСвертки);
	ПараметрыОбработки.Вставить("ТолькоВыбранныеОрганизации"				, Объект.ТолькоВыбранныеОрганизации = 1);
	ПараметрыОбработки.Вставить("УстановитьДатуЗапретаИзмененияДанных"		, Объект.УстановитьДатуЗапретаИзмененияДанных);
	ПараметрыОбработки.Вставить("КоличествоСтрокВДокументеВводаОстатков"	, Объект.КоличествоСтрокВДокументеВводаОстатков);
	ПараметрыОбработки.Вставить("СпособыСверткиОбъектовМетаданных"			, Объект.СпособыСверткиОбъектовМетаданных.Выгрузить(, "ТипОбъектаМД,ОбъектМД,СпособСвертки"));
										 
	// В файловом режиме работы выполняем операцию непосредственно (синхронно).
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		Обработки.СверткаИнформационнойБазы.СвернутьИнформационнуюБазу(ПараметрыОбработки, АдресХранилища);
		Результат = Новый Структура("ЗаданиеВыполнено", Истина);
		// В клиент-серверном режиме работы выполняем операцию в фоновом задании (асинхронно).
	Иначе
		НаименованиеЗадания = НСтр("ru = 'Удаление записей регистров и установка пометки на удаление документов.'");
		
		Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(УникальныйИдентификатор,
																"Обработки.СверткаИнформационнойБазы.СвернутьИнформационнуюБазу", 
																ПараметрыОбработки,
																НаименованиеЗадания);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СформироватьОтчетНаСервере(ПараметрыОтчета)
	
	РезультатПроверки.Очистить();
	
	ИБФайловая = ОбщегоНазначения.ИнформационнаяБазаФайловая();
	
	ИдентификаторЗадания = Неопределено;
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, ЭтаФорма.УникальныйИдентификатор);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.РезультатПроверки, "НеИспользовать");
	
	Если ИБФайловая Тогда
		
		Обработки.СверткаИнформационнойБазы.СформироватьОтчетПроверкиОстатков(ПараметрыОтчета, АдресХранилища);
		РезультатВыполнения = Новый Структура("ЗаданиеВыполнено", Истина);
		
		Возврат РезультатВыполнения;
		
	КонецЕсли;
	
	НаименованиеЗадания = НСтр("ru = 'Формирование отчета'");
	
	РезультатВыполнения = ДлительныеОперации.ЗапуститьВыполнениеВФоне(ЭтаФорма.УникальныйИдентификатор,
															"Обработки.СверткаИнформационнойБазы.СформироватьОтчетПроверкиОстатков",
															ПараметрыОтчета,
															НаименованиеЗадания);
	
	Если РезультатВыполнения <> Неопределено Тогда
		АдресХранилища = РезультатВыполнения.АдресХранилища;
		Возврат РезультатВыполнения;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ОбработкаПроверкиЗаполнения(НаборПоказателей)
	
	Если Объект.ТипДанных <> "РегистрыБухгалтерии" Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЕстьВыбранныеПоказатели = Ложь;
	
	Для Каждого Показатель из НаборПоказателей Цикл
		Если Показатель.Значение Тогда
			ЕстьВыбранныеПоказатели = Истина;    
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьВыбранныеПоказатели Тогда
		ТекстСообщения = НСтр("ru = 'Не выбран показатель(и)'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ПоказательБУ");
	КонецЕсли;
	
	Возврат ЕстьВыбранныеПоказатели;
	
КонецФункции

&НаСервере
Функция ПодготовитьПараметрыОтчета()
	
	НеборПоказателей = Новый Структура();
	Если Объект.ТипДанных = "РегистрыБухгалтерии" Тогда
		НеборПоказателей.Вставить("БУ",Объект.ПоказательБУ);
		НеборПоказателей.Вставить("НеУчитываетсяНУ",Объект.ПоказательНеУчитываетсяНУ);
		НеборПоказателей.Вставить("ЕНВД",Объект.ПоказательЕНВД);
		НеборПоказателей.Вставить("НДС",Объект.ПоказательНДС);
	КонецЕсли;

	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("ПериодСвертки"                    , Объект.ПериодСвертки);
	ПараметрыОтчета.Вставить("ПоказательБУ"                     , Объект.ПоказательБУ);
	ПараметрыОтчета.Вставить("ПоказательНеУчитываетсяНУ"        , Объект.ПоказательНеУчитываетсяНУ);
	ПараметрыОтчета.Вставить("ПоказательЕНВД"                   , Объект.ПоказательЕНВД);
	ПараметрыОтчета.Вставить("ПоказательНДС"                    , Объект.ПоказательНДС);
	ПараметрыОтчета.Вставить("ПоСубсчетам"                      , ПоСубсчетам);
	ПараметрыОтчета.Вставить("НаборПоказателей"                 , НеборПоказателей);
	ПараметрыОтчета.Вставить("Организации"		                , Объект.Организации);
	ПараметрыОтчета.Вставить("ТипДанных"		                , Объект.ТипДанных);
	ПараметрыОтчета.Вставить("СписокРегистровСведений"		    , СписокРегистровСведений);
	ПараметрыОтчета.Вставить("СписокРегистровНакопления"	    , СписокРегистровНакопления);
	
	Возврат ПараметрыОтчета;

КонецФункции

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()

	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	РезультатПроверки   = РезультатВыполнения.Результат;

	ИдентификаторЗадания = Неопределено;

	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.РезультатПроверки, "НеИспользовать");
	
	Обработки.СверткаИнформационнойБазы.СкрыватьНастройкиПриФормированииОтчета(ЭтаФорма);
	
КонецПроцедуры

// Процедура заполняет список регистров сведений и накопления, которые были выбраны для свертки в настройках.
// Периодические регистры сведений и оборотные регистры накопления исключаются.
&НаСервере
Процедура ЗаполнитьТаблицуМетаданных()
	
	СписокРегистровНакопления.Очистить();
	СписокРегистровСведений.Очистить();
	
	МДРегистрыСведений = Метаданные.РегистрыСведений;
	МДРегистрыНакопления = Метаданные.РегистрыНакопления;
	
	ТаблицаЗначенийСворачиваемыхРегистров = Объект.СпособыСверткиОбъектовМетаданных.Выгрузить();
	
	ОбъектыМетаданных = Метаданные.Документы.КорректировкаРегистров.Движения;
	МассивРегистровСведений = Новый Массив;
	МассивРегистровНакопления = Новый Массив;
	
	Для Каждого ОбъектМД из ОбъектыМетаданных Цикл
		Если МДРегистрыНакопления.Найти(ОбъектМД.Имя) <> Неопределено Тогда
			МетаданныеРегистра = МДРегистрыНакопления.Найти(ОбъектМД.Имя);
			Если МетаданныеРегистра.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Обороты Тогда
				Продолжить;
			КонецЕсли;
			МассивРегистровНакопления.Добавить(ОбъектМД.Имя);
		ИначеЕсли МДРегистрыСведений.Найти(ОбъектМД.Имя) <> Неопределено Тогда
			МетаданныеРегистра = МДРегистрыСведений.Найти(ОбъектМД.Имя);
			//по регистрам с периодичностью <> ПозицияРегистратора остатки вводятся на этапе удаления движений
			Если МетаданныеРегистра.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.ПозицияРегистратора Тогда
				Продолжить;
			КонецЕсли;
			МассивРегистровСведений.Добавить(ОбъектМД.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗначенийСворачиваемыхРегистров.ТипОбъектаМД КАК ТипОбъектаМД,
	|	ТаблицаЗначенийСворачиваемыхРегистров.ОбъектМД КАК ОбъектМД,
	|	ТаблицаЗначенийСворачиваемыхРегистров.ОбъектМДСиноним КАК ОбъектМДСиноним,
	|	ТаблицаЗначенийСворачиваемыхРегистров.СпособСвертки КАК СпособСвертки
	|ПОМЕСТИТЬ ВТТаблицаЗначенийСворачиваемыхРегистров
	|ИЗ
	|	&ТаблицаЗначенийСворачиваемыхРегистров КАК ТаблицаЗначенийСворачиваемыхРегистров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТаблицаЗначенийСворачиваемыхРегистров.ОбъектМД КАК Имя,
	|	ВТТаблицаЗначенийСворачиваемыхРегистров.ОбъектМДСиноним КАК Синоним,
	|	ВТТаблицаЗначенийСворачиваемыхРегистров.ТипОбъектаМД
	|ИЗ
	|	ВТТаблицаЗначенийСворачиваемыхРегистров КАК ВТТаблицаЗначенийСворачиваемыхРегистров
	|ГДЕ
	|	ВТТаблицаЗначенийСворачиваемыхРегистров.СпособСвертки = ""Свернуть""
	|	И ВТТаблицаЗначенийСворачиваемыхРегистров.ТипОбъектаМД = ""РегистрСведений""
	|	И ВТТаблицаЗначенийСворачиваемыхРегистров.ОбъектМД В(&СписокРегистровСведений)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТТаблицаЗначенийСворачиваемыхРегистров.ОбъектМД,
	|	ВТТаблицаЗначенийСворачиваемыхРегистров.ОбъектМДСиноним,
	|	ВТТаблицаЗначенийСворачиваемыхРегистров.ТипОбъектаМД
	|ИЗ
	|	ВТТаблицаЗначенийСворачиваемыхРегистров КАК ВТТаблицаЗначенийСворачиваемыхРегистров
	|ГДЕ
	|	ВТТаблицаЗначенийСворачиваемыхРегистров.СпособСвертки = ""Свернуть""
	|	И ВТТаблицаЗначенийСворачиваемыхРегистров.ТипОбъектаМД = ""РегистрНакопления""
	|	И ВТТаблицаЗначенийСворачиваемыхРегистров.ОбъектМД В(&СписокРегистровНакопления)";
	Запрос.УстановитьПараметр("СписокРегистровСведений",МассивРегистровСведений);
	Запрос.УстановитьПараметр("СписокРегистровНакопления",МассивРегистровНакопления);
	Запрос.УстановитьПараметр("ТаблицаЗначенийСворачиваемыхРегистров",ТаблицаЗначенийСворачиваемыхРегистров);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРегистров = РезультатЗапроса.Выгрузить();

	Для Каждого ТекущийРегистр из ТаблицаРегистров Цикл
		Если ТекущийРегистр.ТипОбъектаМД = "РегистрСведений" Тогда
			СписокРегистровСведений.Добавить(ТекущийРегистр.Имя, ТекущийРегистр.Синоним, Истина);
		ИначеЕсли ТекущийРегистр.ТипОбъектаМД = "РегистрНакопления" Тогда
			СписокРегистровНакопления.Добавить(ТекущийРегистр.Имя, ТекущийРегистр.Синоним, Истина);
		КонецЕсли;
	КонецЦикла;
	СписокРегистровНакопления.СортироватьПоЗначению();	
	СписокРегистровСведений.СортироватьПоЗначению();
	
	ТаблицаМетаданныхЗаполнена = Истина;

КонецПроцедуры

&НаКлиенте
Процедура СпособыСверткиРегистровПриИзменении(Элемент, ДанныеВыбора, ТекущиеДанныеЭлемента)
	
	СписокВыбора = ТекущиеДанныеЭлемента.ДоступныеСпособы;
	НачальноеЗначение = СписокВыбора.НайтиПоЗначению(ТекущиеДанныеЭлемента.СпособСвертки);
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьИзСпискаСпособСверткиЗавершение", ЭтотОбъект, ТекущиеДанныеЭлемента);
	ПоказатьВыборИзСписка(Оповещение, СписокВыбора, Элемент, НачальноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособыСверткиРегистровОчистка(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИзСпискаСпособСверткиЗавершение(Результат, ТекущиеДанныеЭлемента) Экспорт
	
	Если Результат <> Неопределено Тогда
		ТекущиеДанныеЭлемента.СпособСвертки = Результат.Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПриПереходеКПредыдущемуЭтапуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СообщениеОбЭтапеВыполненияСвертки = "Удаление сформированных остатков.";
		Результат = УдалитьДокументыВводаОстатковНаСервере(Объект.ПериодСвертки);
		ПроверитьСтатусВыполненияЗадания(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдалитьСтарыеДокументыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Результат = СвернутьИнформационнуюБазуНаСервере();
		ПроверитьСтатусВыполненияЗадания(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросВосстановитьРекомендуемыеНастройки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Для Каждого СтрокаРегистра Из Объект.СпособыСверткиОбъектовМетаданных Цикл
			СтрокаРегистра.СпособСвертки = СтрокаРегистра.СпособСверткиПоУмолчанию;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Способы свертки, отличающиеся от значения по умолчанию
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.СпособыСверткиРегистровБухгалтерииСпособСвертки.Имя);
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.СтраницаРегистрыНакопленияСпособСвертки.Имя);
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.СтраницаРегистрыСведенийСпособСвертки.Имя);
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.СтраницаДокументыСпособСвертки.Имя);	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.СпособыСверткиОбъектовМетаданных.СпособСверткиПоУмолчанию", ВидСравненияКомпоновкиДанных.Заполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.СпособыСверткиОбъектовМетаданных.СпособСверткиПоУмолчанию", ВидСравненияКомпоновкиДанных.НеРавно,
		Новый ПолеКомпоновкиДанных("Объект.СпособыСверткиОбъектовМетаданных.СпособСвертки"));		
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОтличающейсяСтрокиДокумента);
	
КонецПроцедуры

Функция ПолучитьПустуюСтруктуруСтатусаСверткиИнформационнойБазы()
	
	Статус = Новый Структура;
	Статус.Вставить("СпособыСверткиОбъектовМетаданных"		, Новый ТаблицаЗначений);
	Статус.Вставить("ПериодСвертки"							, '00010101');
	Статус.Вставить("КоличествоСтрокВДокументеВводаОстатков", 0);
	Статус.Вставить("ТолькоВыбранныеОрганизации"			, Ложь);
	Статус.Вставить("Организации"							, Новый СписокЗначений);
	Статус.Вставить("ТекущийЭтапСвертки"					, 0);
	Статус.Вставить("АктивизацияДвижений"					, Истина);
	Статус.Вставить("РекомендуемыеПараметры"				, Истина);
	Статус.Вставить("УстановитьДатуЗапретаИзмененияДанных"	, Истина);
	
	Возврат Статус;
	
КонецФункции

#КонецОбласти
